# Practical SQL

In [1]:
import psycopg2
import pandas as pd
from sql_data import db, usr, pwd

In [2]:
# Connecting to postgreSQL database
conn = psycopg2.connect(
    host = "localhost",
    database = db,
    user = usr,
    password = pwd,
    port = 5432
)

# Activating  the connection cursor
cur = conn.cursor()

## Chapter 2:

** Challenge Queries **

** Write a query that lists the schools in alphabetical order along with teachers ordered by last name A-Z **

SELECT school, first_name, last_name
FROM teachers
ORDER BY school, last_name;

** Write a query that finds the one teacher whose first name starts with the letter S and who earns more that $40k **

SELECT *
FROM teachers
WHERE salary > 40000 AND
	first_name ILIKE 's%';
	
** Rank teachers hired since Jan 1, 2010, ordered by highest paid to lowest **
SELECT *
FROM teachers
WHERE hire_date >= '2010-01-01'
ORDER BY salary DESC;

In [3]:
# Write a query that lists the schools in alphabetical order along with teachers ordered by last name A-Z
ch2_q1 = """
SELECT school, first_name, last_name
FROM teachers
ORDER BY school, last_name;
"""

cur.execute(ch2_q1)
results1 = cur.fetchall()
df1= pd.DataFrame(results1)
df1.head()

                     0         1         2
0    F.D. Rossevelt HS       Lee  Reynolds
1    F.D. Rossevelt HS  Kathleen     Roush
2    F.D. Rossevelt HS     Janet     Smith
3  Myers Middle School  Samantha      Bush
4  Myers Middle School    Samuel      Cole

In [4]:
# Write a query that lists the schools in alphabetical order along with teachers ordered by last name A-Z

ch2_q2 = """
SELECT school, first_name, last_name
FROM teachers
ORDER BY school, last_name;
"""

cur.execute(ch2_q2)
results2 = cur.fetchall()
df2= pd.DataFrame(results1)
df2.head()

                     0         1         2
0    F.D. Rossevelt HS       Lee  Reynolds
1    F.D. Rossevelt HS  Kathleen     Roush
2    F.D. Rossevelt HS     Janet     Smith
3  Myers Middle School  Samantha      Bush
4  Myers Middle School    Samuel      Cole

In [5]:
# Rank teachers hired since Jan 1, 2010, ordered by highest paid to lowest **
ch2_q3 = """
SELECT *
FROM teachers
WHERE hire_date >= '2010-01-01'
ORDER BY salary DESC;
"""

cur.execute(ch2_q3)
results3 = cur.fetchall()
df3= pd.DataFrame(results1)
df3.head()

                     0         1         2
0    F.D. Rossevelt HS       Lee  Reynolds
1    F.D. Rossevelt HS  Kathleen     Roush
2    F.D. Rossevelt HS     Janet     Smith
3  Myers Middle School  Samantha      Bush
4  Myers Middle School    Samuel      Cole

In [6]:
# Closing the cursor
cur.close()
del cur

# Closing the connection
conn.close()